{
  "bugs": [
    {
      "id": "BUG-001",
      "timestamp": "2026-01-02T21:56:00Z",
      "phase": 1,
      "level": 1,
      "severity": "cosmetic",
      "category": "ui",
      "title": "Inconsistent validation: username allows underscores, character names don't",
      "description": "When registering an account, usernames allow underscores (e.g., 'playtest_20260102'). However, when creating a character, underscores are rejected with 'Character name contains invalid characters'. The validation message says '3-20 alphanumeric characters' but doesn't specify this excludes underscores that work in username.",
      "expected": "Consistent validation rules between username and character name, or clearer error messaging",
      "actual": "Username 'playtest_20260102' accepted, but character name 'Dusty_Tester' rejected",
      "screenshot": null,
      "location": "Character creation modal - Step 1 of 2",
      "reproducible": "always",
      "blocked": false
    },
    {
      "id": "BUG-002",
      "timestamp": "2026-01-02T22:05:00Z",
      "phase": 1,
      "level": 1,
      "severity": "minor",
      "category": "ui",
      "title": "ERROR 400 'Invalid tutorial step' on tutorial section transition",
      "description": "When completing the 'Frontera Job' tutorial section (Step 5/5, 19% complete) and pressing Enter to advance, an error banner appeared at the top of the screen: 'ERROR 400 - Invalid tutorial step'. The tutorial still advanced to the next section 'Survival Instincts' (24% complete), so the error is non-blocking but concerning.",
      "expected": "Tutorial should transition smoothly between sections without API errors",
      "actual": "Error 400 'Invalid tutorial step' displayed on screen, but tutorial continues to work",
      "screenshot": null,
      "location": "Tutorial transition from 'Frontera Job' to 'Survival Instincts'",
      "reproducible": "once",
      "blocked": false
    },
    {
      "id": "BUG-003",
      "timestamp": "2026-01-02T22:15:00Z",
      "phase": 1,
      "level": 1,
      "severity": "major",
      "category": "progression",
      "title": "Tutorial combat encounter never spawns - 'Survival Instincts' section stuck",
      "description": "The 'Survival Instincts' tutorial section (Step 3/4, 33% complete) requires the player to 'Fight the attacker'. The tutorial dialogue says 'A figure steps out from the shadows, weapon drawn!' and instructs the player to fight. However, NO combat encounter appears anywhere on the page. The Location page shows only Jobs and Criminal Opportunities - no combat/fight action exists. Checked multiple pages (Location, tried navigating to Actions). The tutorial is stuck in 'Waiting for action...' state indefinitely. Required skipping this tutorial section to continue progression.",
      "expected": "A combat encounter should spawn when this tutorial step begins, allowing the player to fight an NPC attacker",
      "actual": "No combat encounter spawns. Tutorial stuck waiting for 'Fight the attacker' action that doesn't exist. Player must skip section to continue.",
      "screenshot": null,
      "location": "Tutorial 'Survival Instincts' Step 3/4 - Location page (Smuggler's Den)",
      "reproducible": "always",
      "blocked": true
    },
    {
      "id": "BUG-004",
      "timestamp": "2026-01-02T22:20:00Z",
      "phase": 1,
      "level": 1,
      "severity": "minor",
      "category": "security",
      "title": "CSRF token error when skipping tutorial section",
      "description": "When clicking 'Skip Section' button to bypass the stuck 'Survival Instincts' tutorial, a 'FORBIDDEN - Invalid or expired CSRF token' error banner appeared at the top of the screen. The tutorial section was still skipped successfully despite the error. The error auto-dismissed after a few seconds.",
      "expected": "Tutorial skip action should complete without CSRF token errors",
      "actual": "FORBIDDEN error displayed, but action still succeeds. May indicate CSRF token refresh issue during long sessions.",
      "screenshot": null,
      "location": "Tutorial 'Survival Instincts' - Skip Section button",
      "reproducible": "sometimes",
      "blocked": false,
      "notes": "Occurred again during tutorial section transition at 38% complete"
    },
    {
      "id": "BUG-005",
      "timestamp": "2026-01-02T22:35:00Z",
      "phase": 1,
      "level": 1,
      "severity": "major",
      "category": "progression",
      "title": "Tutorial references non-existent 'Abandoned Mine' location",
      "description": "The 'Making a Living' tutorial section (Step 2/5, 43% complete) instructs the player to 'Head to the Abandoned Mine'. However, this location does not exist in the game. Searched all nearby locations from Smuggler's Den and The Frontera: only found Smuggler's Den, The Frontera, The Badlands, Red Gulch, Kaiowa Mesa, Sangre Canyon, and Whiskey Bend. No 'Abandoned Mine' or similar mining location exists. The Gathering page shows 'No gathering nodes available at this location' at both Smuggler's Den and The Frontera. The tutorial cannot be completed as written.",
      "expected": "An 'Abandoned Mine' location should exist and be accessible from the starting area, OR the tutorial should reference an existing location with mining nodes",
      "actual": "No Abandoned Mine location exists. Tutorial stuck waiting for player to reach a non-existent destination.",
      "screenshot": null,
      "location": "Tutorial 'Making a Living' Step 2/5 - Location page",
      "reproducible": "always",
      "blocked": true
    },
    {
      "id": "BUG-006",
      "timestamp": "2026-01-02T22:45:00Z",
      "phase": 1,
      "level": 1,
      "severity": "minor",
      "category": "ui",
      "title": "Tutorial panel disappears after navigating to different locations",
      "description": "After navigating from Smuggler's Den to The Frontera and back while searching for the 'Abandoned Mine', the tutorial panel completely disappeared from the UI. The panel was visible at 43% complete in the 'Making a Living' section. After navigation, no tutorial elements exist in the DOM (verified with JavaScript query). There's no way to resume or access the tutorial from the UI.",
      "expected": "Tutorial panel should persist across navigation, or provide a way to re-open it",
      "actual": "Tutorial panel vanishes after navigating to different locations. No way to resume tutorial.",
      "screenshot": null,
      "location": "Global - after navigating between Smuggler's Den and The Frontera",
      "reproducible": "once",
      "blocked": false,
      "notes": "May be related to tutorial getting stuck on non-existent location. Tutorial was at 43% complete before disappearing."
    },
    {
      "id": "BUG-007",
      "timestamp": "2026-01-02T23:00:00Z",
      "phase": 1,
      "level": 1,
      "severity": "cosmetic",
      "category": "ui",
      "title": "FALSE POSITIVE - Jobs Work button requires JavaScript click (MCP click issue)",
      "description": "RESOLVED: Jobs work correctly when clicked via JavaScript. The initial report was due to MCP click tool clicking on adjacent static text instead of the actual button. The Work button functions properly - tested 'Smuggle Goods' which opened Destiny Deck game, completed successfully with +32 XP and +18 Gold reward.",
      "expected": "Jobs work correctly with proper button targeting",
      "actual": "Jobs work correctly. MCP automation click tool has targeting issues with some buttons.",
      "screenshot": null,
      "location": "Location page - Available Jobs section - 'Work' button",
      "reproducible": "not-a-bug",
      "blocked": false,
      "notes": "Successfully completed job: Smuggle Goods at Smuggler's Den. Hand: One Pair (Speed +25), Score: 125, Suit Matches: 3/5 (1.5x), Rewards: +32 XP, +18 Gold. Jobs system WORKS."
    },
    {
      "id": "BUG-008",
      "timestamp": "2026-01-02T23:02:00Z",
      "phase": 1,
      "level": 1,
      "severity": "minor",
      "category": "api",
      "title": "SERVER ERROR 'Failed to advance step' after completing crime",
      "description": "After successfully completing the 'Pickpocket Drunk' crime (gained +22 XP, +6 Gold), clicking 'Continue' on the results screen triggered a server error banner: 'SERVER ERROR - Failed to advance step'. This appears to be related to the (now vanished) tutorial trying to track player progress. The error is non-blocking - the crime rewards were properly applied.",
      "expected": "No error should appear after completing a crime action",
      "actual": "SERVER ERROR banner displayed. Crime still completed successfully.",
      "screenshot": null,
      "location": "Crime results screen - Continue button",
      "reproducible": "always",
      "blocked": false,
      "notes": "Confirmed reproducible - occurred after every crime completion (19+ times)"
    },
    {
      "id": "BUG-009",
      "timestamp": "2026-01-02T23:15:00Z",
      "phase": 1,
      "level": 1,
      "severity": "minor",
      "category": "ui",
      "title": "Quest buttons do not respond to clicks - no modal or acceptance",
      "description": "On the Quests page, clicking any quest in the 'Available' tab (tested 'Welcome to the Frontier' Main Quest) does nothing. No modal appears, no quest details shown, and the quest is not accepted. The 'Active' tab remains at 0 items after clicking. Multiple quests tested with same result. Quests are displayed correctly with rewards shown, but cannot be accepted or viewed.",
      "expected": "Clicking a quest should either show quest details or accept the quest, moving it to 'Active' tab",
      "actual": "Quest buttons have no effect. Clicks registered but no response. Cannot accept any quests.",
      "screenshot": null,
      "location": "Quests page - Available tab - any quest button",
      "reproducible": "always",
      "blocked": false,
      "notes": "14 quests visible (daily, side, main, event quests) but none can be accepted"
    },
    {
      "id": "BUG-010",
      "timestamp": "2026-01-03T00:45:00Z",
      "phase": 1,
      "level": 1,
      "severity": "major",
      "category": "ui",
      "title": "DOOM system disables ALL crimes with no explanation or timer",
      "description": "After completing approximately 19 successful crimes, ALL crime buttons became disabled simultaneously. The UI shows 'This path leads to the grave...' text and '☠️ DOOM' markers next to each crime, but provides NO explanation of: (1) why crimes are locked, (2) how long the lockout lasts, (3) what triggered the lockout. Player has 30 energy remaining (enough for crimes) but cannot perform any. Jobs are also disabled (but that's due to BUG-007). This creates a complete progression block with no guidance on resolution.",
      "expected": "DOOM system should show: (1) Clear explanation of why crimes are locked (e.g., 'Too much heat from recent crimes'), (2) Timer showing when crimes will be available again, (3) Possible ways to reduce DOOM status faster",
      "actual": "All crime buttons disabled with vague 'This path leads to the grave...' message. No timer, no explanation, no way to know when gameplay can resume.",
      "screenshot": null,
      "location": "Location page - Criminal Opportunities section",
      "reproducible": "once",
      "blocked": true,
      "notes": "Occurred after ~19 successful Pickpocket Drunk crimes. Bounty at $500. Energy at 30/150. UPDATE: DOOM persists even during jail time - relationship between DOOM and jail unclear."
    },
    {
      "id": "BUG-011",
      "timestamp": "2026-01-03T01:25:00Z",
      "phase": 1,
      "level": 1,
      "severity": "major",
      "category": "ui",
      "title": "Jail status has no timer or clear indication - players don't know they're jailed",
      "description": "After failing Crime #20 (Pickpocket Drunk with 5m jail penalty), the character was sent to jail. However, the UI provides almost NO indication of this: (1) The only indicator is a small '⛓️ Jail' text in the sidebar with no timer, (2) Attempting to travel shows 'Cannot travel while in jail' error - this is the ONLY way to discover you're jailed, (3) No countdown timer showing remaining jail time, (4) No explanation of what landed you in jail, (5) Crime buttons show 'DOOM' markers but not 'JAILED' status. Player has no idea they're in jail, how long it lasts, or what they can do.",
      "expected": "Clear jail status indicator with: (1) Prominent 'You are in jail' message, (2) Countdown timer showing remaining time, (3) Explanation of why you were jailed (e.g., 'Caught during Pickpocket attempt'), (4) Info about what actions are available during jail",
      "actual": "Only a subtle '⛓️ Jail' icon in sidebar. No timer. Only discovered jail status by trying to travel and getting error. Complete UX failure for jail system.",
      "screenshot": null,
      "location": "Global UI - sidebar and Location page",
      "reproducible": "always",
      "blocked": true,
      "notes": "Crime #20 failed with 3 face cards (busted). Pickpocket Drunk has 5m jail on failure. No way to know when jail ends."
    },
    {
      "id": "BUG-012",
      "timestamp": "2026-01-03T01:35:00Z",
      "phase": 1,
      "level": 1,
      "severity": "minor",
      "category": "ui",
      "title": "Jail indicator doesn't clear when jail ends - stale UI state",
      "description": "After jail time expired (confirmed by successfully traveling between locations), the '⛓️ Jail' indicator in the sidebar remained visible. The indicator never updated or disappeared. Only way to know jail had ended was to attempt an action (travel) that succeeded. This creates confusion as the UI shows the player is still jailed when they're actually free.",
      "expected": "Jail indicator should automatically disappear or update when jail time expires. Ideally with a countdown timer that reaches zero and then removes the indicator.",
      "actual": "Jail indicator remains visible indefinitely after jail has ended. Player cannot trust the UI to know their actual status.",
      "screenshot": null,
      "location": "Global UI - sidebar jail indicator",
      "reproducible": "always",
      "blocked": false,
      "notes": "Discovered when travel succeeded despite jail indicator still showing. Jail was 5 minutes for Pickpocket Drunk failure. Over 15 minutes passed before testing travel again - jail had clearly expired but indicator persisted."
    },
    {
      "id": "BUG-013",
      "timestamp": "2026-01-03T02:00:00Z",
      "phase": 1,
      "level": 1,
      "severity": "minor",
      "category": "ui",
      "title": "PARTIAL FIX - Building buttons require JavaScript click (MCP click issue)",
      "description": "UPDATED: Building buttons work correctly with JavaScript click. The initial MCP click tool didn't trigger them, but using element.click() via JavaScript opens the building modal correctly. The modal shows 'Enter Building' button which also works. Successfully entered El Cantina del Diablo saloon and accessed: The Bar (Have a Drink, Socialize), Rest Area (Take a Bath, Full Rest), Gambling Corner (Play Cards), Card Tables (Create Table). Buildings are accessible but require workaround for MCP automation.",
      "expected": "Building buttons should work with standard clicks",
      "actual": "Building buttons work with JavaScript click. MCP automation tool has targeting issues. Once inside buildings, all features accessible.",
      "screenshot": null,
      "location": "The Frontera - Town Buildings section",
      "reproducible": "not-a-bug",
      "blocked": false,
      "notes": "Successfully entered El Cantina del Diablo. Features found: Bar (drinks, socialize), Rest Area (bath, full rest), Gambling Corner (Play Cards disabled by energy), Card Tables (Create Table works). Have a Drink costs $3 and worked correctly."
    },
    {
      "id": "BUG-014",
      "timestamp": "2026-01-03T04:35:00Z",
      "phase": 1,
      "level": 4,
      "severity": "major",
      "category": "api",
      "title": "Server returns isJailed:true even when jailedUntil timestamp has passed",
      "description": "API endpoint /api/characters/{id} returns 'isJailed: true' with 'jailedUntil: 2026-01-03T04:18:50.262Z' even when current time is 04:30+ (12+ minutes after jail should have expired). The server is not automatically clearing the jail status when the time expires. This causes the UI to show stale jail indicators (BUG-012) because the server itself has stale data. The jail status only appears to clear when some other action triggers a state update.",
      "expected": "Server should automatically set isJailed to false when current time > jailedUntil, or clear the status on character fetch",
      "actual": "Server returns isJailed: true even 12+ minutes after jailedUntil timestamp. Jail indicator persists in UI because server data is stale.",
      "screenshot": null,
      "location": "API - /api/characters/{characterId}",
      "reproducible": "always",
      "blocked": false,
      "notes": "Discovered by inspecting network response. jailedUntil was 04:18:50, current time 04:30+. Server still returns isJailed: true. This is the root cause of BUG-012."
    },
    {
      "id": "BUG-015",
      "timestamp": "2026-01-03T04:35:00Z",
      "phase": 1,
      "level": 4,
      "severity": "major",
      "category": "progression",
      "title": "DOOM (Gambler's Curse) requires gambling to remove, but gambling is inaccessible",
      "description": "The '☠️ DOOM' markers blocking all crimes are caused by the Gambler deity's UNLUCKY_STREAK curse. The curse description is 'The dice have turned against you. Every flip, a loss.' The ONLY way to remove this curse is to 'Win 3 fair gambles' according to the removal condition. However, gambling activities are located inside town buildings (e.g., El Cantina del Diablo). Due to BUG-013, building buttons don't work, making gambling inaccessible. This creates a deadlock: can't remove curse without gambling, can't gamble without entering buildings, can't enter buildings due to bug.",
      "expected": "Either: (1) Gambling should be accessible outside buildings, (2) Building buttons should work, (3) Curse should have alternative removal methods or time-based expiration",
      "actual": "Curse has no expiration (expiresAt: null). Only removal is gambling. Gambling is blocked by BUG-013. Complete deadlock for crime-focused gameplay.",
      "screenshot": null,
      "location": "Karma system - Gambler deity curse",
      "reproducible": "always",
      "blocked": true,
      "notes": "Curse inflicted at 2026-01-03T04:03:51.151Z after ~19 crimes. Character also has OUTLAWS_FREEDOM blessing from Outlaw King (expires 2026-01-10). The blessing says 'Chains cannot hold you' which might explain why jail wasn't fully blocking - but curse still blocks crimes."
    },
    {
      "id": "BUG-016",
      "timestamp": "2026-01-03T04:45:00Z",
      "phase": 1,
      "level": 4,
      "severity": "major",
      "category": "progression",
      "title": "Gambling page games non-functional, but saloon card tables partially work",
      "description": "UPDATED: Two gambling systems exist: (1) Gambling Den page (/game/gambling) - still broken, games don't respond to clicks. (2) Saloon Card Tables - PARTIALLY WORKS! Can create tables for Euchre/Spades/Hearts/Bridge/Pinochle, add AI players, enable stakes. However, game gets stuck on 'Starting game...' and never actually starts (see BUG-017). The card table system took $10 stake but game didn't complete. Gambling page still completely broken. Saloon gambling is the better path but has its own bug.",
      "expected": "Either gambling page or saloon card tables should allow completing a gambling game",
      "actual": "Gambling page broken. Saloon card tables get stuck on 'Starting game...' after all players ready.",
      "screenshot": null,
      "location": "Gambling Den page and Saloon Card Tables",
      "reproducible": "always",
      "blocked": true,
      "notes": "Gambling Den: Blackjack modal broken, other games unresponsive. Saloon (El Cantina del Diablo): Create Table works, Add AI works, Ready Up works, but actual game never starts. See BUG-017 for card table specific issue."
    },
    {
      "id": "BUG-017",
      "timestamp": "2026-01-03T05:45:00Z",
      "phase": 1,
      "level": 4,
      "severity": "critical",
      "category": "progression",
      "title": "Saloon card table game gets stuck on 'Starting game...' - takes gold but never starts",
      "description": "Created a Euchre table at El Cantina del Diablo with $10 stakes. Added 3 AI players (Riverboat Rita, Poker Face Phil, Four-Finger Frank). All players showed 'Ready' status. Clicked 'Ready Up' which changed to 'Not Ready' and showed 'LOADING... Starting game...' status. Game never progressed past loading state. Waited over 2 minutes. Could not leave table (Leave Table button didn't work). Had to navigate away via URL. Lost $10 stake with no game played. This is a critical bug blocking all saloon gambling which was the only potential path to remove DOOM curse.",
      "expected": "After all players ready up, the Euchre game should start with card dealing and gameplay",
      "actual": "Game stuck on 'Starting game...' indefinitely. Gold deducted ($10 stake) but no game occurs. Cannot leave table. Must force navigate away.",
      "screenshot": null,
      "location": "El Cantina del Diablo - Card Tables - Euchre with AI players",
      "reproducible": "always",
      "blocked": true,
      "notes": "Tested with Euchre, 4 players (1 human + 3 AI), $10 stakes enabled. All players showed Ready status. Loading spinner appeared with 'Starting game...' text. Never progressed. Leave Table button non-functional during stuck state. Lost $10 from $271 to $261."
    },
    {
      "id": "BUG-018",
      "timestamp": "2026-01-03T07:15:00Z",
      "phase": 1,
      "level": 4,
      "severity": "minor",
      "category": "ui",
      "title": "Tavern Socialize button disabled despite having enough energy",
      "description": "In El Cantina del Diablo, the 'Socialize' tavern activity shows 'Need energy' and is disabled even when character has 7 energy and the activity only costs 5 energy. The button text shows 'Free • 5⚡ Need energy' but 7 > 5 so the requirement should be met. Additionally, 'Have a Drink' is on cooldown (7+ minutes) even though only 'Take a Bath' was used - suggesting either a shared cooldown bug or incorrect cooldown display.",
      "expected": "Socialize button should be enabled when character has >= 5 energy. Each activity should have independent cooldowns.",
      "actual": "Socialize shows 'Need energy' when character has 7 energy (costs 5). Have a Drink on cooldown without being used.",
      "screenshot": null,
      "location": "El Cantina del Diablo - The Bar section - Socialize button",
      "reproducible": "always",
      "blocked": false,
      "notes": "Character energy: 7/150. Socialize cost: 5 energy. Button still disabled. This may be related to cooldown logic affecting availability checks incorrectly."
    }
  ],
"summary": {
    "total": 18,
    "critical": 2,
    "major": 5,
    "minor": 9,
    "cosmetic": 2,
    "progression_blockers": 5,
    "false_positives": 2,
    "notes": "BUG-007 and BUG-013 were MCP automation issues, not real bugs. BUG-018 added for tavern button enable state bug."
  }
}
